In [1]:
import sqlite3

In [2]:
sqlite_db = 'houses.sqlite'
conn = sqlite3.connect(sqlite_db)
c = conn.cursor()

In [3]:
c.execute('CREATE TABLE houses (pk INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')

In [4]:
conn.commit()

In [5]:
last_sale = (None, 4000, 5, 22, 619000)
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', last_sale)
conn.commit()

In [6]:
c.execute('SELECT * FROM houses;')

In [7]:
conn.commit()

In [8]:
results = c.execute('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000)]

In [9]:
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', recent_sales)

conn.commit()

In [10]:
results = c.execute('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000)]

In [11]:
from numpy import genfromtxt

data = (genfromtxt('housing-data.csv', dtype='i8', delimiter=',', skip_header=1)).tolist()

data

[[2104, 3, 70, 399900],
 [1600, 3, 28, 329900],
 [2400, 3, 44, 369000],
 [1416, 2, 49, 232000],
 [3000, 4, 75, 539900],
 [1985, 4, 61, 299900],
 [1534, 3, 12, 314900],
 [1427, 3, 57, 198999],
 [1380, 3, 14, 212000],
 [1494, 3, 15, 242500],
 [1940, 4, 7, 239999],
 [2000, 3, 27, 347000],
 [1890, 3, 45, 329999],
 [4478, 5, 49, 699900],
 [1268, 3, 58, 259900],
 [2300, 4, 77, 449900],
 [1320, 2, 62, 299900],
 [1236, 3, 78, 199900],
 [2609, 4, 5, 499998],
 [3031, 4, 21, 599000],
 [1767, 3, 44, 252900],
 [1888, 2, 79, 255000],
 [1604, 3, 13, 242900],
 [1962, 4, 53, 259900],
 [3890, 3, 36, 573900],
 [1100, 3, 60, 249900],
 [1458, 3, 29, 464500],
 [2526, 3, 13, 469000],
 [2200, 3, 28, 475000],
 [2637, 3, 25, 299900],
 [1839, 2, 40, 349900],
 [1000, 1, 5, 169900],
 [2040, 4, 75, 314900],
 [3137, 3, 67, 579900],
 [1811, 4, 24, 285900],
 [1437, 3, 50, 249900],
 [1239, 3, 22, 229900],
 [2132, 4, 28, 345000],
 [4215, 4, 66, 549000],
 [2162, 4, 43, 287000],
 [1664, 2, 40, 368500],
 [2238, 3, 37, 329900],
 [2567, 4, 57, 314000],
 [1200, 3, 76, 299000],
 [852, 2, 70, 179900],
 [1852, 4, 64, 299900],
 [1203, 3, 11, 239500]]

In [12]:
for d in data:
    d.insert(0, None)
    
data[0:3]

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000]]

In [13]:
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)
    
conn.commit()

In [14]:
results = c.execute('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000),
 (5, 2104, 3, 70, 399900),
 (6, 1600, 3, 28, 329900),
 (7, 2400, 3, 44, 369000),
 (8, 1416, 2, 49, 232000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (11, 1534, 3, 12, 314900),
 (12, 1427, 3, 57, 198999),
 (13, 1380, 3, 14, 212000),
 (14, 1494, 3, 15, 242500),
 (15, 1940, 4, 7, 239999),
 (16, 2000, 3, 27, 347000),
 (17, 1890, 3, 45, 329999),
 (18, 4478, 5, 49, 699900),
 (19, 1268, 3, 58, 259900),
 (20, 2300, 4, 77, 449900),
 (21, 1320, 2, 62, 299900),
 (22, 1236, 3, 78, 199900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (25, 1767, 3, 44, 252900),
 (26, 1888, 2, 79, 255000),
 (27, 1604, 3, 13, 242900),
 (28, 1962, 4, 53, 259900),
 (29, 3890, 3, 36, 573900),
 (30, 1100, 3, 60, 249900),
 (31, 1458, 3, 29, 464500),
 (32, 2526, 3, 13, 469000),
 (33, 2200, 3, 28, 475000),
 (34, 2637, 3, 25, 299900),
 (35, 1839, 2, 40, 349900),
 (36, 1000, 1, 5, 169900),
 (37, 2040, 4, 75, 314900),
 (38, 3137, 3, 67, 579900),
 (39, 1811, 4, 24, 285900),
 (40, 1437, 3, 50, 249900),
 (41, 1239, 3, 22, 229900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (45, 1664, 2, 40, 368500),
 (46, 2238, 3, 37, 329900),
 (47, 2567, 4, 57, 314000),
 (48, 1200, 3, 76, 299000),
 (49, 852, 2, 70, 179900),
 (50, 1852, 4, 64, 299900),
 (51, 1203, 3, 11, 239500)]

In [15]:
import pandas as pd
from pandas.io import sql

In [16]:
data = pd.read_csv('housing-data.csv')
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [17]:
conn

In [18]:
data.to_sql('houses_pandas_are_cool', con=conn, if_exists='replace', index=False)

In [19]:
results = c.execute('SELECT * FROM houses_pandas_are_cool;')
results.fetchall()[0:5]

[(2104, 3, 70, 399900),
 (1600, 3, 28, 329900),
 (2400, 3, 44, 369000),
 (1416, 2, 49, 232000),
 (3000, 4, 75, 539900)]

In [20]:
this_data_came_from_sql = sql.read_sql('SELECT * FROM houses_pandas_are_cool;', con=conn)

In [21]:
this_data_came_from_sql.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [24]:
def helper_function(command):
    print sql.read_sql(command, con=conn)

In [25]:
helper_function('SELECT sqft FROM houses;')

    sqft
0   4000
1   2390
2   1870
3   1505
4   2104
5   1600
6   2400
7   1416
8   3000
9   1985
10  1534
11  1427
12  1380
13  1494
14  1940
15  2000
16  1890
17  4478
18  1268
19  2300
20  1320
21  1236
22  2609
23  3031
24  1767
25  1888
26  1604
27  1962
28  3890
29  1100
30  1458
31  2526
32  2200
33  2637
34  1839
35  1000
36  2040
37  3137
38  1811
39  1437
40  1239
41  2132
42  4215
43  2162
44  1664
45  2238
46  2567
47  1200
48   852
49  1852
50  1203

In [26]:
helper_function('SELECT age, sqft, bdrms FROM houses')

    age  sqft  bdrms
0    22  4000      5
1    34  2390      4
2    14  1870      3
3    90  1505      3
4    70  2104      3
5    28  1600      3
6    44  2400      3
7    49  1416      2
8    75  3000      4
9    61  1985      4
10   12  1534      3
11   57  1427      3
12   14  1380      3
13   15  1494      3
14    7  1940      4
15   27  2000      3
16   45  1890      3
17   49  4478      5
18   58  1268      3
19   77  2300      4
20   62  1320      2
21   78  1236      3
22    5  2609      4
23   21  3031      4
24   44  1767      3
25   79  1888      2
26   13  1604      3
27   53  1962      4
28   36  3890      3
29   60  1100      3
30   29  1458      3
31   13  2526      3
32   28  2200      3
33   25  2637      3
34   40  1839      2
35    5  1000      1
36   75  2040      4
37   67  3137      3
38   24  1811      4
39   50  1437      3
40   22  1239      3
41   28  2132      4
42   66  4215      4
43   43  2162      4
44   40  1664      2
45   37  2238      3
46   57  2567      4
47   76  1200      3
48   70   852      2
49   64  1852      4
50   11  1203      3

In [27]:
helper_function('SELECT * FROM houses LIMIT 10;')

   pk  sqft  bdrms  age   price
0   1  4000      5   22  619000
1   2  2390      4   34  319000
2   3  1870      3   14  289000
3   4  1505      3   90  269000
4   5  2104      3   70  399900
5   6  1600      3   28  329900
6   7  2400      3   44  369000
7   8  1416      2   49  232000
8   9  3000      4   75  539900
9  10  1985      4   61  299900

In [28]:
helper_function('SELECT * FROM houses WHERE bdrms = 4;')

    pk  sqft  bdrms  age   price
0    2  2390      4   34  319000
1    9  3000      4   75  539900
2   10  1985      4   61  299900
3   15  1940      4    7  239999
4   20  2300      4   77  449900
5   23  2609      4    5  499998
6   24  3031      4   21  599000
7   28  1962      4   53  259900
8   37  2040      4   75  314900
9   39  1811      4   24  285900
10  42  2132      4   28  345000
11  43  4215      4   66  549000
12  44  2162      4   43  287000
13  47  2567      4   57  314000
14  50  1852      4   64  299900

In [29]:
helper_function('SELECT * FROM houses WHERE bdrms = 4 LIMIT 5;')

   pk  sqft  bdrms  age   price
0   2  2390      4   34  319000
1   9  3000      4   75  539900
2  10  1985      4   61  299900
3  15  1940      4    7  239999
4  20  2300      4   77  449900

In [30]:
helper_function('SELECT * FROM houses WHERE bdrms = 4 and price < 300000;')

   pk  sqft  bdrms  age   price
0  10  1985      4   61  299900
1  15  1940      4    7  239999
2  28  1962      4   53  259900
3  39  1811      4   24  285900
4  44  2162      4   43  287000
5  50  1852      4   64  299900

In [31]:
helper_function('SELECT COUNT(*) FROM houses;')

   COUNT(*)
0        51

In [34]:
helper_function('SELECT AVG(sqft), MIN(price), MAX(price) FROM houses WHERE bdrms=2;')

   AVG(sqft)  MIN(price)  MAX(price)
0     1496.5      179900      368500

Question 1: What's the average price per room for 1 bedroom apartment?

In [35]:
helper_function('SELECT AVG(price) FROM houses WHERE bdrms=1;')

   AVG(price)
0    169900.0

Question 2: What's the average price per bedroom for a 2 bedroom apartment?

In [36]:
helper_function('SELECT AVG(price)/2 FROM houses WHERE bdrms=2;')

    AVG(price)/2
0  140433.333333

Question 3: What is the most frequent apartment size in terms of number of bedrooms?

In [37]:
helper_function('SELECT bdrms, COUNT(*) FROM houses GROUP BY bdrms;')

   bdrms  COUNT(*)
0      1         1
1      2         6
2      3        27
3      4        15
4      5         2

Question 4: How old is the oldest 3 bedroom apartment?

In [38]:
helper_function('SELECT MAX(age) FROM houses WHERE bdrms = 3;')

   MAX(age)
0        90

In [39]:
helper_function('SELECT * FROM houses WHERE bdrms = 3 and age = 90;')

   pk  sqft  bdrms  age   price
0   4  1505      3   90  269000

Question 5: How old is the newest apartment?

In [40]:
helper_function('SELECT MIN(age) FROM houses;')

   MIN(age)
0         5

Question 6: What is the average age for the whole dataset?

In [42]:
helper_function('SELECT AVG(age) FROM houses;')

    AVG(age)
0  42.529412

In [43]:
helper_function('SELECT bdrms, AVG(age) FROM houses GROUP BY bdrms;')

   bdrms   AVG(age)
0      1   5.000000
1      2  56.666667
2      3  39.370370
3      4  46.000000
4      5  35.500000